[
  {
    "category": "main",
    "url": "/main/midnight_pasta",
    "title": "Midnight Pasta",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462282/clarklake_cookbook/midnight_pasta_sm_y34xux.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462283/clarklake_cookbook/midnight_pasta_lg_auoemb.jpg",
    "yield": 4,
    "prepTime": 10,
    "cookTime": 10,
    "ingredientsList": [
      "½ pound spaghetti",
      "Salt",
      "3 tablespoons extra virgin olive oil",
      "4 garlic cloves, peeled and roughly chopped",
      "4 anchovy filets, rinsed and roughly chopped",
      "1 tablespoon capers, rinsed and roughly chopped",
      "½ teaspoon red pepper flakes, or to taste",
      "2 tablespoons chopped parsley, optional",
      "Parmesan for grating, optional"
    ],
    "directionsList": [
      "Put the spaghetti in a large pot of well-salted rapidly boiling water and cook only until firmly al dente. (Depending on the brand of pasta, this will be 8 to 10 minutes, but check frequently to see. )",
      "While the pasta is cooking, warm the olive oil in a small skillet over medium heat. Add the garlic and cook for about 1 minute, without letting it brown. Stir in the anchovies, capers and red pepper and cook for a half-minute more, then turn off the heat.",
      "Drain the pasta and return it to the pot. Pour in the garlic mixture, add the parsley, if using, and toss well to coat. Serve with grated Parmesan if desired."
    ],
    "dietary": [],
    "tags": [
      "midnight pasta",
      "anchovy",
      "noodles",
      "italian",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/pork_dumplings",
    "title": "Pork & Cabbage Dumplings",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1616098099/clarklake_cookbook/pork_dumplings_sm_vd6ets.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1616098100/clarklake_cookbook/pork_dumplings_lg_e6vqi4.jpg",
    "yield": "20 dumplings",
    "prepTime": "1H 30M",
    "cookTime": "5M",
    "ingredientsList": [
      "200g pork mince",
      "1 egg",
      "3 tbsp chicken stock",
      "2 tsp cornflour (cornstarch)",
      "1 tsp sea salt",
      "½ tsp sesame oil",
      "½ cup chopped cabbage",
      "20 gyoza wrappers",
      "4 tbsp chilli oil or homemade chilli oil",
      "4 tbsp light soy sauce",
      "2 tbsp white vinegar",
      "¼ clove of garlic, finely grated",
      "2 tbsp finely sliced spring onion (scallions)"
    ],
    "directionsList": [
      "For the spicy sauce, mix chilli oil, soy sauce, white vinegar, grated glaric and scallions together. Set aside until ready to serve.",
      "For the filling, place the pork, egg, chicken stock, cornflour, salt, sesame oil and Chinese garlic chives in a large bowl. Mix vigorously for 2-3 minutes or until the mixture is ‘sticky’.",
      "Place a tablespoon of filling into the centre of a dumpling wrapper, moisten the edges with water and fold the wrapper over the filling. Pinch in the sides and squeeze to create pleats (watch the video for the technique). It can be harder to fold store-bought wrappers in this way. You can also just fold the wrapper over the filling and seal without pleats.",
      "Bring a large pot of water to the boil over high heat. Have a jug of cold water nearby. Add the dumplings and cook until they float to the surface. Then pour in ½ a cup of cold water. Wait for the water to boil again. Then add another ½ cup of cold water. Wait for the water to boil again and by this time the dumplings should be cooked through. If not, repeat the process. Use a slotted spoon to transfer the dumplings to a bowl. Spoon over the spicy dumpling sauce and serve."
    ],
    "dietary": [
      "DF"
    ],
    "tags": [
      "pork dumplings",
      "dumplings",
      "chinese",
      "pork and cabbage dumplings",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/salt_and_pepper_roast_chicken",
    "title": "Salt & Pepper Roast Chicken",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662444/clarklake_cookbook/salt_and_pepper_roast_chicken_sm_fuwa89.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662445/clarklake_cookbook/salt_and_pepper_roast_chicken_lg_ff7keh.jpg",
    "yield": "1 chicken",
    "prepTime": "5M",
    "cookTime": "1.5H",
    "ingredientsList": [
      "1 tsp black peppercorns",
      "1 tsp white peppercorns",
      "1 tbsp sea salt",
      "1 lime, cut into wedges",
      "1 x 2kg (4.4 lb) whole chicken"
    ],
    "directionsList": [
      "Preheat the oven to 250°C/480°F.",
      "Use a mortar and pestle to grind the peppercorns to a medium-fine powder. Mix the pepper with the salt. ",
      "To prepare the chicken, pat it dry inside and out with paper towel. Fill the cavity with the lime wedges. Truss the legs by tying the hind legs together with string. Rub the pepper salt mixture all over the chicken. Place into an oven-proof frying pan or a roasting tin that fits the chicken snugly. Place in the oven and roast for an hour and twenty minutes (20 minutes per 500g/1 lb) or until the juices run clear when you pierce through one of the leg joints. ",
      "Allow the chicken to rest for 10 minutes. Then carve and serve with the Thai-style spicy dipping sauce."
    ],
    "dietary": [
      "DF",
      "GF"
    ],
    "tags": [
      "salt and pepper roast chicken",
      "roast chicken",
      "chicken",
      "dairy free",
      "gluten free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/green_shakshuka",
    "title": "Green Shakshuka",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662434/clarklake_cookbook/green_shakshuka_sm_vgowo7.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662434/clarklake_cookbook/green_shakshuka_lg_qultul.jpg",
    "yield": 4,
    "prepTime": 20,
    "cookTime": 35,
    "ingredientsList": [
      "3 tablespoons olive oil",
      "1 yellow onion, peeled and thinly sliced",
      "2 garlic cloves, thinly sliced",
      "1 large bunch/1 1/2 pounds Swiss chard, stems and leaves separated and chopped (about 9 cups)",
      "½ teaspoon salt, plus more as needed",
      "⅓ cup half-and-half or heavy cream",
      "8 large eggs",
      "¼ teaspoon black pepper, plus more as needed",
      "3 ounces cotija cheese or queso fresco, crumbled (about 3/4 cup)",
      "1 avocado, sliced, for serving",
      "1 small jalapeño, thinly sliced, for serving",
      "Chopped cilantro, for serving",
      "Smoked hot sauce, for serving",
      "Corn tortillas, toasted, for serving",
      "1 lime, cut into wedges, for serving"
    ],
    "directionsList": [
      "Heat oil in a large cast-iron skillet over medium-low heat. Add onion and cook until softening, 5 minutes. Add the garlic and cook until fragrant, 5 minutes more.",
      "Raise the heat to medium-high, add the chard stems, and cook to release some liquid, 5 minutes. Add the chard leaves, in batches, adding more as they wilt, and continue cooking, stirring occasionally, until completely wilted, 3 to 5 minutes more. Season with 1/2 teaspoon salt, pour in the half-and-half and stir loosely together.",
      "Make eight small hollows in the cooked chard with the back of a spoon. Gently crack an egg into each hollow. Cover with a lid or foil and cook on medium-low until the eggs are just set, but still soft, about 7 to 9 minutes. Remove the lid, sprinkle with salt, pepper, cotija, avocado, jalapeño and cilantro. Serve with smoked hot sauce, toasted tortillas and lime wedges."
    ],
    "dietary": [
      "V",
      "GF"
    ],
    "tags": [
      "green shakshuka",
      "shakshuka",
      "eggs",
      "middle eastern",
      "vegetarian",
      "gluten free",
      "tortilla",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/pantry_pad_thai",
    "title": "Pantry Pad Thai",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662434/clarklake_cookbook/easy_pad_thai_sm_cvxbpl.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662437/clarklake_cookbook/easy_pad_thai_lg_becmio.jpg",
    "yield": 2,
    "prepTime": 30,
    "cookTime": 40,
    "ingredientsList": [
      "150g thin dried rice stick noodles",
      "1 tbsp vegetable oil",
      "¼ red onion, finely diced",
      "150g chicken thigh, cut into small cubes",
      "2 eggs, lightly whisked",
      "¼ cup finely sliced spring onion",
      "1 tbsp roughly chopped roasted cashews",
      "lime wedges, to serve",
      "chilli powder, to serve (optional)",
      "2 tbsp brown sugar",
      "2 tbsp fish sauce",
      "2 tbsp white vinegar",
      "1 tbsp tomato paste"
    ],
    "directionsList": [
      "Soak the noodles in room temperature water for 20-30 minutes.",
      "In the meantime, for the pad Thai sauce, combine the ingredients in a small saucepan over high heat. Bring to a simmer and cook, stirring every so often, for 5 minutes or until the sugar has dissolved and the sauce has thickened slightly.",
      "When you’re ready to cook, bring a large pot of water to the boil. Have that boiling on the side.",
      "Heat the vegetable oil in a wok or large frying pan over high heat. Add the red onion and stir-fry for 30 seconds. Then add the chicken and stir-fry until cooked. Pour in the egg and straight away, remove your noodles from the room temperature water and add them into the side pot of boiling water. Allow noodles to cook for 10-20 seconds and then use tongs to transfer the noodles straight into the wok. Pour over the pad Thai sauce and toss the whole lot together until well combined. Toss through the spring onion.",
      "Divide among serving plates. Top with cashews and serve with a lime wedge and chilli powder, if using."
    ],
    "dietary": [
      "DF"
    ],
    "tags": [
      "pantry pad thai",
      "pad thai",
      "thai",
      "noodles",
      "dairy free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/japanese_curry",
    "title": "Japanese Curry",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662434/clarklake_cookbook/japanese_curry_sm_fbdjqy.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662435/clarklake_cookbook/japanese_curry_lg_evie9i.jpg",
    "yield": 4,
    "prepTime": 20,
    "cookTime": "1H 15M",
    "ingredientsList": [
      "500g (1 lb) chicken thighs, cut into bite-sized pieces",
      "steamed rice to serve",
      "pickled ginger to serve (optional)",
      "50g (1.7 oz) unsalted butter",
      "¼ cup plain flour (all-purpose flour)",
      "2 tbsp curry powder (a Japanese brand preferably)",
      "2 tsp garam masala",
      "2 tbsp vegetable oil",
      "2 garlic cloves, finely chopped",
      "1 small onion, finely diced",
      "¼ cup soy sauce",
      "1 tbsp honey",
      "2 tsp apple cider vinegar",
      "¾ cup apple juice",
      "2 cups chicken stock",
      "2 peeled potatoes, cut into bite-sized pieces",
      "1 carrot, cut into bite-sized pieces",
      "chilli powder to taste",
      "sea salt to taste"
    ],
    "directionsList": [
      "To make the roux, heat the butter in a small saucepan over medium-high heat. When the butter is starting to foam, add the flour. Cook, stirring, for 2-3 minutes or until the mixture has darkened slightly. Stir through the curry powder and garam masala. Cook for a further 2 minutes. Then transfer the mixture to a bowl and set aside for later.",
      "To make the curry sauce, heat the oil in a large wok or saucepan over medium heat. Add the garlic and onion. Season with a pinch of salt and cook, stirring every so often, for 2-3 minutes. Then stir in the roux. Now add the chicken and mix until well coated. Then add the soy sauce, honey, vinegar, apple juice and chicken stock.",
      "Add the potatoes and carrot. Bring the curry to a simmer. Then turn the heat to low and simmer with the lid off for 45 minutes or until the vegetables are tender and the curry sauce has thickened. Taste and season with salt and chilli powder to taste. Remove from heat and serve with steamed rice and pickled ginger if using."
    ],
    "dietary": [
      "GF"
    ],
    "tags": [
      "japanese curry",
      "curry",
      "chicken",
      "japan",
      "rice",
      "gluten free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/chicken_pho",
    "title": "Vietnamese Chicken Pho",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462280/clarklake_cookbook/chicken_pho_sm_fr7ukl.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462280/clarklake_cookbook/chicken_pho_lg_x3mr2h.jpg",
    "yield": 4,
    "prepTime": 20,
    "cookTime": 30,
    "ingredientsList": [
      "1 onion, skin on, halved",
      "4cm (2 inch) piece of ginger, skin on, halved",
      "1 cinnamon stick",
      "3 whole star anise",
      "1 whole chicken",
      "2 tsp sea salt, plus extra to taste",
      "2 tbsp fish sauce, plus extra to taste",
      "400g (14 oz) dried rice stick noodles",
      "½ onion, finey sliced",
      "¼ cup finely sliced spring onion",
      "bean shoots",
      "Thai basil leaves (substitute Italian basil if unavailable)",
      "lime wedges",
      "sliced red chilli"
    ],
    "directionsList": [
      "Dry-roast the onion and ginger in a frying pan over high heat. Cook until the onion starts to blacken in some spots and the ginger is fragrant and starting to colour. Add the cinnamon stick and star anise and cook for a further minute or until fragrant. Remove from heat and set aside.",
      "Place the chicken in a large pot. Cover with water and place over a medium-high heat. Add the onion, ginger, spices, salt and fish sauce. Bring to a gentle simmer. Use a ladle to scoop out and discard any foamy scum that rises to the surface. Then reduce the heat to low and gently simmer for one hour, removing the foam from time to time. Remove the chicken from the broth and place on a cutting board. You can test if the chicken is cooked by inserting a skewer into the thigh. The juices should run clear. If not, place the chicken back into the simmering broth and cook for another 15 minutes. When the chicken is cooked, sliced the meat and discard the bones. Set aside until ready to serve.",
      "Strain the broth and pour it back into a clean saucepan over medium-high heat. Taste and season with extra salt and fish sauce (the amount of seasoning will depend on the amount of water you needed at the start). I find at least 1 teaspoon of each is usually needed for the best flavour.",
      "To serve, cook the noodles in boiling water until tender and divide among serving bowls. Top with the chicken meat and slices of onion. Ladle over the hot broth. Add spring onion and bean shoots. Serve with basil leaves, lime wedges and chilli slices."
    ],
    "dietary": [
      "GF",
      "DF"
    ],
    "tags": [
      "chicken pho",
      "vietnamese",
      "noodles",
      "chicken",
      "soup",
      "gluten free",
      "dairy free",
      "noodle soup",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/spring_rolls",
    "title": "Spring Rolls",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614463287/clarklake_cookbook/spring_rolls_sm_pgfiuw.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614463289/clarklake_cookbook/spring_rolls_lg_pu2soo.jpg",
    "yield": "unlimited",
    "prepTime": 30,
    "cookTime": 10,
    "ingredientsList": [
      "Rice paper sheets",
      "Vermicelli noodles",
      "Cucumber(matchsticks)",
      "Carrots(strips)",
      "Bell Pepper(matchsticks)",
      "Leafy lettuce(malleable parts preferred)",
      "Cliantro",
      "Thai Basil",
      "Shrimp(cooked and halved)",
      "Tofu(matchsticks)",
      "Chicken(cooked and shredded)",
      "5 tbsp water",
      "2 tbsp sugar",
      "1.5 tbsp freshly squeezed lime or lemon juice",
      "3 tbsp fish sauce",
      "1 clove of garlic(minced)",
      "1 Thai chili(thinly sliced)",
      "1/4 cup creamy peanut butter",
      "1 Tablespoon hoisin sauce",
      "2 teaspoons soy sauce",
      "1 clove garlic, mashed(minced)",
      "1 teaspoon Sriracha sauce",
      "1–2 Tablespoons warm water"
    ],
    "directionsList": [
      "To make fishsauce dipping sauce, mix water, sugar, lemon juice, fish sauce and optionally Thai chili and garlic.",
      "To make peanut dipping sauce, mix peanut butter, hoisin sauce, soy sauce and optionally, garlic and sriracha. Add warm water to thin until desired consistency is reached.",
      "When rolling spring rolls, prepare any ingreidents you want listed up above.",
      "Damp rice paper sheets.",
      "Lay ingredients within and roll!"
    ],
    "dietary": [
      "DF"
    ],
    "tags": [
      "spring rolls",
      "vietnamese",
      "wrap",
      "dairy free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/kalguksu",
    "title": "Kalguksu(Korean knife-cut noodles)",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462282/clarklake_cookbook/kalguksu_sm_k7f6mx.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462282/clarklake_cookbook/kalguksu_lg_cavihr.jpg",
    "yield": 4,
    "prepTime": 60,
    "cookTime": 60,
    "ingredientsList": [
      "1 pound chicken breast",
      "16 cups water",
      "16 peeled garlic cloves (about ½ cup)",
      "1 medium onion, cut into quarters",
      "3½ cup all purpose flour, plus ⅓ cup flour to dust",
      "½ cup potato starch",
      "1 medium zucchini, cut into matchsticks (about 1½ cup)",
      "2 green onions, chopped",
      "vegetable oil",
      "toasted sesame oil",
      "kosher salt",
      "fish sauce (or soup soy sauce)",
      "ground black pepper"
    ],
    "directionsList": [
      "Mix with a wooden spoon to form a lump. Knead it by hand until it forms as ball. Put it into a plastic bag, seal it, and let it sit in the fridge or on the kitchen counter for 10 minutes.",
      "Combine flour, starch, 1 teaspoon kosher salt, 2 tablespoons vegetable oil, and 1¼ cup water in a large bowl.",
      "Take the dough out of the plastic bag, knead it for 2 to 5 minutes, and then put it back in. Kneading it in stages like this, and storing it in the plastic bag between sessions will make it soft and pliable with a minimum of effort.",
      "Put water, chicken breast, garlic, and onion in a large stock pot and boil for 1 hour over high heat.",
      "Combine the zucchini matchsticks with ¼ teaspoon kosher salt and set aside for 5 to 10 minutes.",
      "Squeeze the excess water out by hand and sautee with a few drops of vegetable oil in a pan. Set aside.",
      "After an hour of boiling, remove from the heat. Strain. The stock will be about 13 cups at this point and it should look clear but a little milky.",
      "Add 1 tablespoon kosher salt and 2 teaspoons fish sauce (or soup soy sauce) or to taste. Mix well and put it back to the stock pot. Set aside.",
      "Collect the cooked garlic into a small bowl and mash it with a spoon. Add 1 teaspoon kosher salt, ½ teaspoon ground black pepper, and 2 teaspoons toasted sesame oil. Mix well and set aside.",
      "Pull the chicken into thin strips with your fingers and mix it in with the garlic mixture. Set aside",
      "Take out the dough and knead it again for a couple of minutes until it’s really smooth. Divide the dough into 2 balls.",
      "Dust a large cutting board or clean kitchen table with flour and put the dough on it. Roll it out with a rolling pin to a circle about 18 inches wide and 1/16 inch thick (1 or 2 mm). Flip it over occasionally to make it even, round, and flat. If you need to, sprinkle some flour on it when you flip, to keep it from sticking.",
      "Evenly spread some flour on the dough, and fold it over 3 or 4 times. Cut it into thin noodles, about 1/8 inch thick. Sprinkle some flour on them, and gently mix them up to separate them and spread the flour evenly.",
      "Make noodles with the other ball of dough but repeating the steps above.",
      "Bring the stock to a boil and add the noodles. Stir with a wooden spoon and cover.",
      "Cook for 4 to 6 minutes until all the noodles float and some bubbles form on the surface. Remove from the heat.",
      "Ladle into large individual bowls. Put some zucchini on the center of each bowl and add some chicken. Sprinkle some chopped green onion over top, and serve immediately with kimchi and few more side dishes if you have them.",
      "To make spicy version, combine 2 table spoons hot pepper flakes and 2 teaspoons toasted sesame oil in a small bowl. Mix well and serve. When you eat, add some of the mixture to your noodle soup and eat."
    ],
    "dietary": [
      "DF"
    ],
    "tags": [
      "kalguksu",
      "korean",
      "knife cut noodles",
      "noodles",
      "chicken",
      "soup",
      "noodle soup",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/moo_shu_mushrooms",
    "title": "Moo Shu Mushrooms",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462283/clarklake_cookbook/mooshu_chicken_sm_sjqpeq.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462284/clarklake_cookbook/mushoo_chicken_lg_zmh2af.jpg",
    "yield": 4,
    "prepTime": 15,
    "cookTime": 30,
    "ingredientsList": [
      " ⅓ cup dried Chinese wood ear mushrooms (about 10 grams)",
      "¼ packed cup dried day lily buds (about 15 grams)",
      "1 tablespoon Shaoxing wine or dry sherry",
      "1 tablespoon light soy sauce or shoyu",
      "1 teaspoon cornstarch",
      "½ teaspoon white pepper, plus more as needed",
      "Kosher salt",
      "2 ounces pork loin, pork sirloin, chicken breast or extra-firm tofu, cut into 1 1/2- to 2-inch slivers",
      "4 tablespoons roasted sesame oil",
      "3 eggs, thoroughly beaten with a pinch of salt",
      "2 slices fresh ginger",
      "½ pound mixed sliced fresh mushrooms, preferably Asian mushrooms such as shimeji, shiitake, enoki, oyster or maitake",
      "2 scallions, thinly sliced on a sharp bias",
      "¼ teaspoon MSG (optional)"
    ],
    "directionsList": [
      "Rehydrate the dried ingredients for the filling: Place wood ear mushrooms and day lily buds in two separate medium bowls or measuring cups large enough to allow for them to expand about fourfold. Cover with very hot water, and set aside until rehydrated, about 15 minutes. (I use hot tap water, but you could also use water heated on the stovetop or in the microwave.) Drain thoroughly. Remove tough centers from the wood ears, then thinly slice them. Cut day lilies into 2-inch pieces.",
      "While wood ears and day lilies rehydrate, prepare the pork marinade: Combine 1/2 teaspoon Shaoxing wine, 1/2 teaspoon soy sauce, 1/2 teaspoon cornstarch, 1/4 teaspoon white pepper and a pinch of kosher salt in a medium bowl, and whisk with a fork to combine. Add pork and stir roughly with fingertips or chopsticks until thoroughly combined, then continue stirring for 10 seconds. Set aside for 15 minutes at room temperature.",
      "Meanwhile, make the sauce: Combine remaining 2 1/2 teaspoons Shaoxing wine, 2 1/2 teaspoons soy sauce, 1/2 teaspoon cornstarch and 1/4 teaspoon white pepper in a small bowl and whisk with a fork until no lumps remain.",
      "Cook the eggs: Heat wok over high until lightly smoking. Add 2 tablespoons oil and swirl to coat. Pour the beaten eggs into the center and cook without moving for 10 seconds. Continue to cook, breaking up the eggs with a spatula until they are barely set, 30 to 45 seconds. Transfer eggs to a large bowl.",
      "Wipe out wok and return to high heat until lightly smoking. Add 1 tablespoon sesame oil and swirl to coat. Add 1 ginger slice and let sizzle for 5 seconds. Immediately add pork and stir-fry until pork is no longer pink and mostly cooked through, about 1 minute. Discard ginger slice, then transfer pork to bowl with eggs.",
      "Wipe out wok and return to high heat until lightly smoking. Add remaining 1 tablespoon oil and swirl to coat. Add remaining ginger slice and let sizzle for 5 seconds. Immediately add the fresh mushrooms and stir-fry until mushrooms are lightly browned around the edges, 2 to 3 minutes. Add scallions, sliced wood ears and day lilies, and stir-fry until softened and fragrant, about 30 seconds.",
      "Add the pork and eggs back to the wok. Stir sauce to combine again, then add it to the wok along with the MSG, if using. Stir-fry everything to combine and season to taste with salt and more white pepper, if desired. Discard ginger. Transfer moo shu mixture to a serving platter and serve immediately with Mandarin pancakes and hoisin sauce."
    ],
    "dietary": [],
    "tags": [
      "moo shu mushrooms",
      "chinese",
      "wrap",
      "mushrooms",
      "mandarin pancakes",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/vegan_curry_noodle_soup",
    "title": "Vegan Curry Noodle Soup",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614463286/clarklake_cookbook/vegan_green_curry_noodle_soup_sm_tf0jtp.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614463288/clarklake_cookbook/vegan_green_curry_noodle_soup_lg_ewbev8.jpg",
    "yield": 4,
    "prepTime": 5,
    "cookTime": 25,
    "ingredientsList": [
      "2 tsp (10 mL) vegetable oil",
      "1 block (375 g) extra-firm tofu, pressed, cut into 1 cm cubes",
      "¼ tsp salt",
      "1 can (400 mL) full-fat coconut milk ",
      "1 vegetable bouillon cube ",
      "2 cups (480 mL) cold water ",
      "1 cup (30 g) fresh spinach, packed",
      "⅓ cup (10 g) fresh basil, packed ",
      "4 blocks (180 g) rice noodles",
      "1 tsp (5 mL) vegetable oil",
      "4 cloves garlic, thinly sliced",
      "1 large shallot, finely chopped",
      "3 Tbsp (45 g) vegan Thai green curry paste",
      "4 inch stalk of lemongrass, smashed (optional)",
      "3 dry kaffir lime leaves (optional)",
      "1 tsp (5 g) freshly grated ginger (optional)",
      "1 medium bell pepper, thinly sliced (we used a yellow bell pepper)",
      "1½ cups (150 g) snow peas",
      "½ lime, juiced",
      "Fresh basil leaves ",
      "Lime wedges",
      "Bean sprouts",
      "Chili flakes"
    ],
    "directionsList": [
      "To make the tofu: to a large pan on medium-high heat, add the oil. When hot, add the tofu cubes and sprinkle overtop the salt. The salt helps to draw the water out of the tofu and helps it cook faster. Try not to disturb the tofu too much, only toss every 1 - 2 minutes, until golden on all sides, about 7 - 10 minutes.",
      "To make the green broth: to a blender, add the coconut milk, bouillon cube, water, spinach, and basil. Blend on high until smooth.",
      "To a large bowl, add the brown rice noodles and pour boiling water overtop to submerge. Drain after 2 minutes, once the noodles are al dente. Note: refer to package instructions as you may need to cook your noodles differently. Once drained, rinse under warm water to remove the out layer of starch that makes the noodles stick together. Divide the noodles over your bowls.",
      "Once the tofu is golden and crispy on all sides, transfer to a bowl and set aside.",
      "Return the same pan to the heat and add the oil. When hot, add the garlic and shallots and cook until lightly golden, about 3 minutes.",
      "Add the curry paste, lemongrass, kaffir leaves, and ginger. Sauté for a minute.",
      "Add the bell pepper, and cook for an extra 3 minutes.",
      "Add the snow peas and cook for only 30 seconds, before transferring the green blended broth to the pan. Allow this to come to a gentle simmer, and then remove from the heat once heated through. ",
      "Remove the lemongrass and kaffir leaves before serving.",
      "Finally, squeeze in the lime juice, stir, and then ladle the broth overtop the noodles.",
      "Add the tofu to the top of the bowl, and add any desired garnishes. Enjoy!"
    ],
    "dietary": [
      "V",
      "VG",
      "DF",
      "GF"
    ],
    "tags": [
      "vegan curry noodle soup",
      "vegan curry",
      "vegan",
      "curry",
      "noodles",
      "soup",
      "noodle soup",
      "tofu",
      "vegetarian",
      "dairy free",
      "gluten free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/chicken_kebab",
    "title": "Chicken Kebab",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462281/clarklake_cookbook/chicken_kebab_sm_wsqeo0.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462280/clarklake_cookbook/chicken_kebab_lg_qcyvna.jpg",
    "yield": 4,
    "prepTime": 15,
    "cookTime": 30,
    "ingredientsList": [
      "1 lb chicken thighs or breasts cut into bite sizes",
      "1/4 cup olive oil",
      "1/3 cup soy sauce",
      "1/4 cup honey",
      "1 teaspoon minced garlic",
      "salt and pepper to taste",
      "2 bell pepper",
      "1 large onion",
      "1 zucchini"
    ],
    "directionsList": [
      "Place the olive oil, soy sauce, honey, garlic and salt and pepper in a large bowl",
      "Whisk to combine",
      "Add the chicken, bell peppers, zucchini and onion to the bowl. Toss to coat in the marinade and set aside.",
      "Soak wooden skewers in cold water until grill is ready. Preheat grill",
      "Thread chicken and vegetables on skewers",
      "When grill is ready, cook for 5-7 minutes on each side or until chicken is cooked through."
    ],
    "dietary": [
      "DF",
      "GF"
    ],
    "tags": [
      "chicken kebab",
      "chicken",
      "kebab",
      "skewers",
      "grill",
      "marinade",
      "dairy free",
      "gluten free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/bibimbap",
    "title": "Bibimbap",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578770/clarklake_cookbook/bibimbap_sm_sunrb4.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578770/clarklake_cookbook/bibimbap_lg_aad9rm.jpg",
    "yield": 2,
    "prepTime": 40,
    "cookTime": 30,
    "ingredientsList": [
      "2 cups of white rice",
      "Sesame oil",
      "Salt",
      "1 zucchini(matchsticks)",
      "1 carrot(matchsticks)",
      "2 handfuls of spinach",
      "5 shiitake mushrooms(sliced)",
      "2 handful of bean sprouts",
      "1/2 cup of kimchi",
      "2 eggs",
      "4 tbsp gochujang paste",
      "2 tbsp mirin",
      "2 tbsp rice vinegar",
      "1.5 tsp soy sauce",
      "3 tsp white sugar(optional)",
      "1 garlic clove , finely grated",
      "2.5 tsp sesame oil",
      "Sesame seeds",
      "Roasted seaweed"
    ],
    "directionsList": [
      "Rinse the rice and cook in pot with 2.5 cups of water for 20 minutes.",
      "To make the bibimbap sauce, mix gochujang, mirin, rice vinegar, soy sauce, white sugar, grated garlic and sesame oil until sugar is dissolved. Set aside.",
      "Separately cook zucchini, carrots, spinach, mushrooms and beansprouts in sesame oil until cooked and season with salt.",
      "Fry the two eggs to your liking.",
      "Assemble by adding rice in the middle of the bowl, the vegetables around it and the fried egg on top.",
      "Top it with roasted seaweed and sesame seeds. Drizzle the sauce from earlier."
    ],
    "dietary": [
      "V",
      "DF",
      "GF"
    ],
    "tags": [
      "bibimbap",
      "korean",
      "rice",
      "vegetarian",
      "rice bowl",
      "gouchujang",
      "dairy free",
      "gluten free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/chicken_porridge",
    "title": "Chicken Porridge",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578768/clarklake_cookbook/chicken_porridge_sm_g93otg.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578769/clarklake_cookbook/chicken_porridge_lg_hhr1hh.jpg",
    "yield": 8,
    "prepTime": 30,
    "cookTime": 60,
    "ingredientsList": [
      "4lbs chicken (any type)",
      "6 cups of water",
      "4 chicken stock",
      "1 cup long-grain rice",
      "3 tablespoons medium-dry sherry vinegar",
      "2 teaspoons sesame oil",
      "1 inch ginger, peeled and thinly matchsticked",
      "2 teaspoons salt",
      "1 stalk scallion thinly sliced",
      "Cracked pepper",
      "Crushed peanuts"
    ],
    "directionsList": [
      "Bring chicken, rice and water to a boil in 5-quart heavy pot",
      "Add sherry wine vinegar, ginger, scallions, sesame oil and salt and cook at a bare simmer, uncovered until porridge is soft and creamy. About 1-1.5 hours. Stir constantly so the rice will not stick two bottom of pot.",
      "Once porridge is at the desired consistency and chicken is cooked, shred the chicken and return it to the porridge.",
      "Serve with scallions, pepper or crushed peanuts."
    ],
    "dietary": [
      "DF",
      "GF"
    ],
    "tags": [
      "chicken porridge",
      "chicken",
      "porridge",
      "chinese",
      "rice",
      "dairy free",
      "gluten free",
      "soup",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/goulash",
    "title": "Beef Goulash",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578769/clarklake_cookbook/goulash_sm_ykbf02.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578770/clarklake_cookbook/goulash_lg_quctak.jpg",
    "yield": 4,
    "prepTime": "1H 35M",
    "cookTime": "2H 30M",
    "ingredientsList": [
      "2 tablespoons extra virgin olive oil",
      "4 cups onions, thinly sliced",
      "1 tablespoon sugar",
      "3 garlic cloves, minced",
      "1 tablespoon caraway seeds, toasted and ground",
      "1 1/2 tablespoons sweet paprika",
      "1 teaspoon spicy paprika",
      "2 tablespoons minced fresh marjoram leaves",
      "1 teaspoon minced fresh thyme leaves",
      "1 bay leaf",
      "3 tablespoons tomato paste",
      "2 tablespoons balsamic vinegar",
      "4 cups chicken stock",
      "2 1/2 pounds beef shank, cut into 2-inch cubes",
      "1 teaspoon kosher salt",
      "1/4 teaspoon freshly ground black pepper"
    ],
    "directionsList": [
      "In a large saute pan, heat the olive oil and saute the onions and sugar until caramelized.",
      "Add the garlic and caraway seed. Cook for 1 minute.",
      "Add the sweet and sharp paprika, marjoram, thyme, and bay leaf. Saute another minute, until fragrant.",
      "Add the tomato paste. Deglaze with the vinegar and the stock and add the pieces of beef shank, salt, and pepper. Bring to a boil, then lower to a simmer and cook until very tender, about 1 1/2 hours, stirring occasionally.",
      "Taste and adjust seasoning with salt and pepper. Serve with Spaetzle on the side."
    ],
    "dietary": [
      "DF"
    ],
    "tags": [
      "goulash",
      "stew",
      "soup",
      "hungarian",
      "beef",
      "dairy free",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/pizza_margherita",
    "title": "Pizza Margherita",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462285/clarklake_cookbook/pizza_margherita_sm_w11iyf.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462285/clarklake_cookbook/pizza_margherita_lg_vscbrx.jpg",
    "yield": "1 12inch pizza",
    "prepTime": "30",
    "cookTime": "20",
    "ingredientsList": [
      "1 serving of pizza Dough",
      "8oz fresh mozzarella thinly sliced",
      "1/2 cup tomato sauce",
      "Fresh basil leaves"
    ],
    "directionsList": [
      "Preheat oven to 450F.",
      "Make your pizza dough",
      "Top with tomato sauce",
      "Place mozzarella slices evenly and place in oven for 12-15 mins.",
      "Place fresh basil leaves evenly on pizza, slice and serve."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "pizza margherita",
      "pizza",
      "italian",
      "vegetarian",
      "pie",
      "mains"
    ]
  },
  {
    "category": "main",
    "url": "/main/khao_mok_gai",
    "title": "Khao Mok Gai",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578771/clarklake_cookbook/khao_mok_gai_sm_zhgmf8.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615578770/clarklake_cookbook/khao_mok_gai_lg_wqc1uz.jpg",
    "yield": 4,
    "prepTime": 30,
    "cookTime": 45,
    "ingredientsList": [
      "4 garlic cloves",
      "3 coriander (cilantro) roots, roughly chopped",
      "1 tbsp finely chopped ginger",
      "1/2 cup Greek-style yoghurt",
      "1/2 tsp ground turmeric",
      "1 tbsp mild curry powder",
      "2 tbsp fish sauce",
      "8 bone-in chicken pieces",
      "2 tbsp vegetable oil",
      "1 onion, finely diced",
      "2 ripe tomatoes, roughly chopped",
      "2 cups jasmine rice",
      "¼ cup crispy fried shallots, plus extra to serve",
      "2½ cups chicken stock",
      "5 green cardamom pods",
      "1 cinnamon stick",
      "2 bay leaves",
      "roughly chopped coriander, to serve",
      "sweet chilli sauce to serve",
      "sea salt",
      "1 bunch mint, leaves picked",
      "¼ cup coriander (cilantro) stems and leaves",
      "1 green birds’ eye chilli",
      "3 tbsp white vinegar",
      "1 tbsp finely grated ginger",
      "1 tsp sugar"
    ],
    "directionsList": [
      "For the mint sauce, place all the ingredients in the bowl of food processor and blend until smooth. Set aside until ready to serve.",
      "Use a mortar and pestle to pound the garlic, coriander roots, ginger and a pinch of salt to a paste. Transfer the paste to a large bowl and stir through the yoghurt, turmeric, curry powder and fish sauce. Add the chicken and turn to coat. Cover and place in the fridge for 2 hours or overnight to marinate.",
      "Heat the oil in a large, deep, heavy-based frying pan. Use your hands to remove most of the marinade from each chicken piece before placing the chicken into the hot oil. Cook for 3-4 minutes each side or until golden. Transfer the chicken to plate. Reserve about 3 tablespoons of the chicken fat from the bottom of the pan. Clean the pan.",
      "Add the chicken fat back into the clean pan over medium-high heat. Add the onion and a pinch of salt and cook for 2-3 minutes or until the onion is soft. Then add the tomato and cook for another 3 minutes or until the tomato is soft and pulpy. Add the rice and the fried shallots and stir to coat. Add the reserved marinade, stock, cardamom, cinnamon stick and bay leaves. Bring to a simmer stirring. Place the chicken pieces on top of the rice. Cover and reduce the heat to low. Simmer for 25 minutes or until the rice is tender and liquid evaporated.",
      "Move the chicken to one side of the pan. Pluck out and discard any of the whole spices and bay leaves you can find. Use a fork to fluff up the rice. To serve, place the rice and chicken on a plate. Sprinkle with coriander and extra fried shallots. Serve with the mint sauce and the sweet chilli sauce on the side."
    ],
    "dietary": [],
    "tags": [
      "khao mok gai",
      "chicken",
      "rice",
      "tumeric chicken",
      "thai",
      "mains"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/vegan_ccc",
    "title": "Vegan Chocolate Chip Cookies",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614463287/clarklake_cookbook/vegan_chocolate_chip_cookies_sm_sbuw2o.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614463288/clarklake_cookbook/vegan_chocolate_chip_cookies_lg_tsnbwl.jpg",
    "yield": "18-20 Cookies",
    "prepTime": "10 Minutes",
    "cookTime": "15 Minutes",
    "ingredientsList": [
      "1/2 cup (105 g) refined coconut oil, packed, not melted*",
      "2/3 cup (140 g) brown sugar, packed",
      "3 Tbsp (45 mL) maple syrup",
      "6 Tbsp (90 mL) plant-based milk ",
      "1 Tbsp (15 mL) pure vanilla extract",
      "1 tsp (4 g) baking powder",
      "3/4 tsp (3 g) baking soda",
      "1/2 tsp salt",
      "2 cups (250 g) all-purpose flour",
      "1 cup (150 g) dairy-free dark chocolate, chopped*"
    ],
    "directionsList": [
      "Preheat the oven to 350 F/ 180 C.",
      "Using a fork, cream together the coconut oil and brown sugar in a large bowl. Then add the maple syrup and mix until well combined. Add the milk, vanilla, baking soda, baking powder and salt and again whisk until well combined. If the mixture looks clumpy, it’s okay! Note: if the temperature is warm where you are, you may want to consider chilling this mixture in the fridge for 30 minutes to firm up; otherwise the cookies flatten and spread too much when baking in the oven.",
      "Add the flour to the bowl and stir until just-combined (do not over stir). Then gently fold in the chopped chocolate.",
      "Form little balls out of the dough and evenly distribute, about 5 cm (2 inches) apart, on a cookie sheet lined with baking paper. Pro tip: I like to reserve a bit of the chopped chocolate to sprinkle on the top for presentation.",
      "Bake for 12- 15 minutes, or until edges are lightly golden and the tops look set. Cool 1 minute on cooking sheet before transferring to cooling rack to cool completely."
    ],
    "dietary": [
      "V",
      "DF"
    ],
    "tags": [
      "dessert",
      "vegan chocolate chip cookies",
      "cookies",
      "vegan",
      "chocolate",
      "sweet"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/blueberry_pie",
    "title": "Blueberry Pie",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1616098094/clarklake_cookbook/blueberry_pie_sm_pxswkf.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1616098094/clarklake_cookbook/blueberry_pie_lg_xc7qow.jpg",
    "yield": "1 pie",
    "prepTime": "40M",
    "cookTime": "1H",
    "ingredientsList": [
      "5 cups all-purpose flour 600g, plus more for rolling",
      "2 tbsp granulated sugar 100g",
      "1/2 tsp sea salt 2g",
      "2 cups unsalted butter 452g, cold",
      "6 tbsp ice water 90 mL",
      "4 tbsp vodka 60mL, or more ice water if you don't want to use vodka.",
      "1 egg for the egg wash",
      "1 tbsp cream for the egg wash",
      "5 cups blueberries",
      "1 tbsp lemon zest optional",
      "3 tbsp lemon Juice 45mL",
      "1/4 cup corn starch 30g",
      "1/4 cup sugar 100g",
      "2 tbsp butter",
      "1 pinch salt"
    ],
    "directionsList": [
      "You will need to make the pastry crust at least 30 minutes in advance. Most people will want to make two batches of pastry in their food processor. To do this divide the above ingredients in half.",
      "Add the flour, the sugar, and salt into a food processor. Give it a few pulses.",
      "Cut COLD butter into tbsp size pieces. Transfer to food processor and pulse until the butter is cut into small lentil-sized clumps.",
      "Mix the ice water and vodka together in a small cup and slowly drizzle it in while pulsing processor. If the mixture doesn't hold together when you squeeze a clump in your hand add a bit more water and pulse. ",
      "Transfer dough onto a pastry mat or sheet of plastic wrap and knead 2-3 times just to help it come together a bit. Gently flatten into a one inch-thick disk, and cover in plastic wrap. If making the pastry in one large batch divide dough in half and place in the fridge to chill.",
      "Once your pie crust is chilled, remove one of the disks from fridge and let it warm up on the counter for a few minutes, this will prevent cracking. Roll our pie crust to about 1/4 of an inch and transfer to pie pan or baking sheet if making a galette. Bake time will depend on form and filling.",
      "In a small bowl, lightly beat an egg with a tablespoon of cream. Set it aside in the fridge until ready to use for the egg wash.",
      "In a large bowl mix together the blueberries, lemon juice, zest, sugar, salt, and corn starch.",
      "Add filling into the pie shell and smooth the top. Return to refrigerator to chill while you roll out the second disk of dough.",
      "Roll the second disk out to 1/4 an inch thick. Cut into strips for the lattice; the thickness is totally up to you. I will say thicker strips are easier to work with though.",
      "Arrange rows of strips across the top of your pie.",
      "Fold over every other strip halfway up and place another strip of pastry across. Unfold the strips then fold over the other strips. Repeat this process until the lattice is complete.",
      "Trim the excess and pinch together the edge.",
      "Brush with the egg wash and sprinkle with sanding or granulated sugar.",
      "Tent the edge with tin foil and bake at 425F for 20 minutes then reduce temperature to 350 and bake an additional 50 minutes or until golden and bubbling. Allow to cool and enjoy."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "dessert",
      "blueberry pie",
      "pie",
      "sweet",
      "vegetarian"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/banana_bread",
    "title": "Banana Bread",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614627566/clarklake_cookbook/banana_bread_sm_ndxqez.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614627567/clarklake_cookbook/banana_bread_lg_epwxub.jpg",
    "yield": 9,
    "prepTime": 10,
    "cookTime": 40,
    "ingredientsList": [
      "2 spotty bananas (bananas that have more black spots have higher alkalin)",
      "2 cage-free pasteurized eggs",
      "1/2 cup of gluten-free rolled oats blended into flour",
      "1 1/3 cup almond flour",
      "1/3 cup maple syrup",
      "1/4 cup coconut oil",
      "1 tsp baking so",
      "1/2 tsp baking powder",
      "1 tsp cinnamon",
      "1 tsp pure vanilla extract",
      "1/3 full cup of dark chocolate chips"
    ],
    "directionsList": [
      "Whisk all wet ingredients until smooth.",
      "Add in the dry ingredients and mix well to combine",
      "Fold in chocolate chips",
      "Bake 350F for 35-40 mins."
    ],
    "dietary": [
      "V",
      "GF"
    ],
    "tags": [
      "banana bread",
      "bread",
      "banana",
      "dessert",
      "sweet",
      "vegetarian",
      "gluten free"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/classic_cheesecake",
    "title": "Classic Cheesecake",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614627565/clarklake_cookbook/cheesecake_sm_gr2a0a.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614627566/clarklake_cookbook/cheesecake_lg_yrpvyx.jpg",
    "yield": 10,
    "prepTime": 10,
    "cookTime": 60,
    "ingredientsList": [
      "16 Graham Crackers more if you'd like a thicker crust",
      "1 cup pecans 70g, toasted",
      "4 tbsp unsalted butter 56g, melted",
      "1/4 cup sugar 24g",
      "1/2 tsp cinnamon 1g",
      "2 1/2 pounds cream cheese 1.13kg, room temperature, 4.5 packages",
      "1/2 tsp salt",
      "1 3/4 cups sugar 350g",
      "2 tsp vanilla extract 10mL",
      "5 eggs large, room temperature",
      "2 egg yolks",
      "3/4 cup sour cream",
      "3 tbsp All purpose flour"
    ],
    "directionsList": [
      "Preheat oven to 350F.",
      "Add Graham crackers and toasted pecans to your food processor and pulse until broken into small pieces. Add sugar and cinnamon then pulse until mixed in completely. Pour in melted butter while pulsing processor. Remove blades and use a spatula to mix butter in completely. See post above for instructions on making this without a processor or stand mixer.",
      "Transfer mixture to your springform pan and spread our with a spatula so the crumbs are evenly distributed on the bottom and toward the side as well. Press into a flat layer using a tall glass and really try to compact the side to it keeps it's shape after cutting. Bake for about 10-15 minutes at 350, or until fragrant and a darker golden color. Remove from oven, set aside.",
      "Add ROOM TEMPERATURE cream cheese to stand mixer fitted with a whisk attachment and mix at medium speed to cream.",
      "Add the sugar and the salt to the bowl and mix on medium until creamy. Scrape bowl down and mix until completely homogenous.",
      "Add sour cream and vanilla extract, mix well then add the eggs and yolks one at a time, allowing each to incorporate before adding the next. Sprinkle in the flour and continue to mix. Scrape the bowl down and mix until completely smooth.",
      "Pour the batter into the foil-wrapped 10 inch springform pan. The batter will not rise much at all during this low and slow bake so you can fill it up almost to the top. If you're using an 8inch pan then you will have some extra batter for individual/mini cheesecakes, which you can bake in cupcake papers.",
      "Place springform pan into a large roasting pan or on a baking sheet (this makes sure there are no leaks and it's easier to remover from the oven.",
      "Bake at 350F for 20 minutes then reduce temperature to 300F and bake another 40 minutes or until cake's edge is set but center is still wobbly. Turn oven off but leave door closed and allow cake to rest for an additional hour in the oven. Remove from oven and cool to room temperature then cover with a towel or paper towel and chill overnight. You can enjoy the cheesecake after a few hours of chilling but it's MUCH easier to cut if you've chilled it overnight.",
      "You can garnish the cake with dollops of whipped cream, berries, or enjoy plain."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "cheesecake",
      "cake",
      "dessert",
      "sweet",
      "vegetarian"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/pasteis_de_nata",
    "title": "Pastéis de Nata",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614874541/clarklake_cookbook/paste%CC%81is_de_nata_sm_umioqd.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614874542/clarklake_cookbook/paste%CC%81i_de_nata_lg_pkdbfj.jpg",
    "yield": "12 Tarts",
    "prepTime": 60,
    "cookTime": "2H 30M",
    "ingredientsList": [
      "For the pastry...",
      "290g plain flour",
      "1/4 tsp salt",
      "210ml water",
      "240g very soft unsalted butter",
      "extra flour for dusting",
      "40g plain flour",
      "50ml milk",
      "165ml water",
      "240g caster sugar",
      "1 cinnamon stick",
      "another 250ml milk"
    ],
    "directionsList": [
      "In a stand mixer fitted with a dough hook, mix the flour, salt, and water until a soft, pillowy dough forms that pulls away from the side of the bowl, about 30 seconds.",
      "Generously flour a work surface and pat the dough into a 6-inch (15-cm) square using a pastry scraper. Flour the dough, cover with plastic wrap, and let it rest at room temperature for 15 minutes.      ",
      "Roll the dough into an 18-inch (46-cm) square. As you work, use the scraper to lift the dough to make sure the underside isn’t sticking to your work surface.      ",
      "Brush the excess flour off the top of the dough, trim any uneven edges, and, using a small offset spatula, dot and then spread the left 2/3 portion of the dough with a little less than 1/3 of the butter being careful to leave a 1 inch (25 mm) plain border around the edge of the dough.      ",
      "Neatly fold the unbuttered right 1/3 of the dough (using the pastry scraper to loosen it if it sticks) over the rest of the dough. Brush off any excess flour, then fold over the left 1/3 of the dough. Starting from the top, pat down the dough with your hand to release any air bubbles, and then pinch the edges of the dough to seal. Brush off any excess flour.      ",
      "Turn the dough 90° to the left so the fold is facing you. Lift the dough and flour the work surface. Once again roll it out to an 18-inch (46-cm) square, then dot the left 2/3 of the dough with 1/3 of the butter and smear it over the dough. Fold the dough as directed in steps 4 and 5.    ",
      "For the last rolling, turn the dough 90° to the left and roll out the dough to an 18-by-21-inch (46-by-53-cm) rectangle, with the shorter side facing you. Spread the remaining butter over the entire surface of the dough.    ",
      "Using the spatula as an aid, lift the edge of dough closest to you and roll the dough away from you into a tight log, brushing the excess flour from the underside as you go. Trim the ends and cut the log in half. Wrap each piece in plastic wrap and chill for 2 hours or preferably overnight. (The pastry can be frozen for up to 3 months.)    ",
      "In a medium bowl, whisk the flour and 1/4 cup milk (60 ml) until smooth.     ",
      "Bring the sugar, cinnamon, and water to a boil in a small saucepan and cook until an instant-read thermometer registers 220°F (104°C). Do not stir.     ",
      "Meanwhile, in another small saucepan, scald the remaining 1 cup milk (237 ml). Whisk the hot milk into the flour mixture.     ",
      "Remove the cinnamon stick and then pour the sugar syrup in a thin stream into the hot milk-and-flour mixture, whisking briskly. Add the vanilla and stir for a minute until very warm but not hot. Whisk in the yolks, strain the mixture into a bowl, cover with plastic wrap, and set aside. The custard will be thin; that is as it should be. (You can refrigerate the custard for up to 3 days.)    ",
      "Assemble and bake the pastries",
      "Place an oven rack in the top third position and heat the oven to 550°F (290°C). Remove a pastry log from the refrigerator and roll it back and forth on a lightly floured surface until it’s about an inch (25 mm) in diameter and 16 inches (41 cm) long. Cut it into scant 3/4-inch (18-mm) pieces. Place 1 piece pastry dough, cut side down, in each well of a nonstick 12-cup mini-muffin pan (2-by-5/8-inch [50-by-15-mm] size). If using classic tins, cut the dough into generous 1-inch (25-mm) pieces. Allow the dough pieces to soften several minutes until pliable.    ",
      "Have a small cup of water nearby. Dip your thumbs in the water, then straight down into the middle of the dough spiral. Flatten it against the bottom of the cup to a thickness of about 1/16 inch (1.5 mm), then smooth the dough up the sides and create a raised lip about 1/8 inch (3 mm) above the pan. The pastry bottoms should be thinner than the tops.  ",
      "Fill each cup 3/4 full with the cool custard. Bake the pastries until the edges of the dough are frilled and brown, about 8 to 9 minutes for the mini-muffin tins, 15 to 17 minutes for the classic tins.",
      "Remove from the oven and allow the pasteis to cool a few minutes in the pan, then transfer to a rack and cool until just warm. Sprinkle the pasteis generously with confectioners’ sugar, then cinnamon and serve. Repeat with the remaining pastry and custard. These are best consumed the day they’re made."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "pasteis de nata",
      "portuguese egg tart",
      "portuguese",
      "egg tart",
      "tart",
      "dessert",
      "sweet",
      "pastry",
      "vegetarian"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/blood_orange_scones",
    "title": "Kitten Orange Scones",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614876906/clarklake_cookbook/blood_orange_scone_sm_narlci.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614874540/clarklake_cookbook/blood_orange_scone_lg_lj3wnb.jpg",
    "yield": 10,
    "prepTime": 30,
    "cookTime": 20,
    "ingredientsList": [
      "3 cups (448g) all purpose flour",
      "generous pinch of salt",
      "2 teaspoons (8g) baking powder ",
      "1/2 teaspoon (4g)  baking soda  ",
      "1/2 cup (112g) cold 1/2 inch cubed butter(keep in fridge until ready to use)",
      "1/2 cup (95g) heavy cream",
      "3/4 cup (175g) whole milk",
      "1/4 cup (58g) granulated sugar",
      "zest of one whole lemon",
      "zest of half of a blood orange ",
      "1 cup (150g) powdered sugar",
      "juice from one blood orange (43g)"
    ],
    "directionsList": [
      "Preheat oven to 400°F",
      "In in large bowl, mix the all purpose flour, sugar, baking powder, baking soda and salt. Whisk until incoporated.",
      "Add the grated zest of whole lemon and zest of half of a blood orange to the mixture. Whisk till incorporated.",
      "Add COLD cubed butter into the mixture and lightly toss to coat with flour.",
      "Use your fingers to pinch and break apart the cubes of butter into the flour until you are left with pea sized chunks of butter. Keep coating the butter with flour as you are breaking it apart. It is crucial to do this step swiftly as to not allow the butter to melt.",
      "To the mixture, add the heavy cream and whole milk. Using a wooden spoon, mix until it just comes together forms a dough. Do not overmix. You don't want to develop too much gluten.",
      "Go in with your hands and lightly fold the dough over itself and lightly press onto itself until it comes together in a ball.",
      "Lightly dust a work surface with flour and place your dough ball onto it. Your dough ball is meant to look a bit shaggy and scrappy.",
      "Roll your dough out to an about 9 inch long rectangle.",
      "Fold the dough rectangle into thrids like a letter and rotate the whole 90 degrees.",
      "Repeat the process until you have folded it 3 times.",
      "Now roll your dough out to a circular shape until it is about 3 inches thick.",
      "Cut the dough like you would a pizza into 8 even triangles.",
      "Arrange on parchment lined baking sheet keeping them separate",
      "Lightly brush your triangles with heavy cream before placing in preheated oven for 15-18 minutes.",
      "While waiting for scones to finish baking, whisk powdered sugar and juice from a blood orange to from a smooth glaze.",
      "When scones are done, let scones cool for 15 minutes put as much or little glaze on top."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "blood orange scones",
      "kitten orange scones",
      "blood orange",
      "kitten orange",
      "scones",
      "dessert",
      "sweet",
      "pastry",
      "vegetarian"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/cny_cake",
    "title": "Chinese New Year Cake",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614874538/clarklake_cookbook/cny_cake_sm_i2w4ca.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614874536/clarklake_cookbook/cny_cake_lg_prc61m.jpg",
    "yield": "2 loaves",
    "prepTime": "10M",
    "cookTime": "50M",
    "ingredientsList": [
      "1 lb. bag of glutinous rice flour  (Erawan Brand look for the green bag)",
      "1 cups brown sugar",
      "2 Tbsp. oil",
      "2 1/4 cups filtered water"
    ],
    "directionsList": [
      "Boil the water and brown sugar until fully mixed.  Let cool to about room temperature.  Do not use until it's cooled or else you'll end up cooking the rice flour mixture (instead of steaming it).",
      "Steam the batter for 50 minutes.",
      "Let the cakes cool on your countertop for about 2 hours, then remove from the moulds & store in an airtight container in the refrigerator for at least 3 hours.  It's best if you plan to store it overnight in the fridge, that way you're not impatiently waiting around for it to cool.",
      "Slice the cakes and lightly pan fry on medium-low heat for about 3 min. on each side or until it's soft and gooey."
    ],
    "dietary": [
      "V",
      "VG",
      "DF"
    ],
    "tags": [
      "chinese new year cake",
      "cake",
      "chinese",
      "new year",
      "mochi",
      "sweet",
      "dessert",
      "vegetarian",
      "vegan",
      "dairy free"
    ]
  },
  {
    "category": "dessert",
    "url": "/dessert/apple_pie",
    "title": "Apple Pie",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614874536/clarklake_cookbook/apple_pie_sm_ctjbt8.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614874540/clarklake_cookbook/apple_pie_lg_w6x4m4.jpg",
    "yield": "1 Pie",
    "prepTime": "30M",
    "cookTime": "1H",
    "ingredientsList": [
      "1 recipe pastry for a 9 inch double crust pie",
      "½ cup unsalted butter",
      "3 tablespoons all-purpose flour",
      "¼ cup water",
      "½ cup white sugar ",
      "½ cup packed brown sugar",
      "8 Granny Smith apples - peeled, cored and sliced"
    ],
    "directionsList": [
      "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.",
      "Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust. Gently pour the sugar and butter liquid over the crust. Pour slowly so that it does not run off.",
      "Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "apple pie",
      "pie",
      "apple",
      "dessert",
      "sweet",
      "vegetarian"
    ]
  },
  {
    "category": "other",
    "url": "/other/classic_pesto",
    "title": "Classic Pesto",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462283/clarklake_cookbook/pesto_sm_vgvcoi.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462284/clarklake_cookbook/pesto_lg_pposac.jpg",
    "yield": "2 Cups",
    "prepTime": "15 Minutes",
    "cookTime": "0 Minutes",
    "ingredientsList": [
      "2 cups fresh basil leaves (no stems)",
      "2 tablespoons pine nuts",
      "2 large cloves garlic",
      "½ cup extra-virgin olive oil",
      "½ cup freshly grated parmesan cheese",
      "Salt to taste"
    ],
    "directionsList": [
      "Combine basil leaves, pine nuts or walnuts and garlic in a food processor and process until very finely minced.",
      "With the machine running slowly dribble in the oil and process until the mixture is smooth.",
      "Add the cheese and process very briefly, just long enough to combine. Store in refrigerator or freezer."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "pesto",
      "basil",
      "sauce",
      "pine nuts",
      "vegetarian",
      "italian"
    ]
  },
  {
    "category": "other",
    "url": "/other/focaccia_bread",
    "title": "Focaccia Bread",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462282/clarklake_cookbook/focaccia_sm_ct1mqb.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462282/clarklake_cookbook/focaccia_lg_a4w95i.jpg",
    "yield": 30,
    "prepTime": "4 Hours",
    "cookTime": "35 Minutes",
    "ingredientsList": [
      "6¼ cups bread flour (30 oz. or 850g)",
      "2¼ tsp. active dry yeast (from one ¼-oz. packet)",
      "Pinch of sugar",
      "2 Tbsp. Diamond Crystal or 1 Tbsp. Morton kosher salt",
      "5 Tbsp. extra-virgin olive oil, divided, plus more for greasing and drizzling",
      "Flaky sea salt"
    ],
    "directionsList": [
      "Combine flour and 2½ cups room-temperature water in the bowl of a stand mixer fitted with the dough hook. Mix on low speed, scraping down sides and hook as needed to incorporate any dry flour, until a shaggy dough forms. Remove dough hook and cover bowl with plastic. Let sit while you prepare the yeast (you can leave the dough in this state up to 2 hours).",
      "Stir yeast, sugar, and ½ cup warm water with a fork in a small bowl to dissolve. Let sit until yeast is foamy, about 5 minutes.",
      "Pour yeast mixture into stand mixer bowl and mix on low speed until dough absorbs all additional water, about 1 minute (pulse mixer on and off a couple of times at very beginning to prevent liquid from splashing over the sides). Add kosher salt and continue to mix, increasing speed to medium, until dough is extremely elastic and very sticky (it will look more like a thick batter and will stick to sides of bowl), about 5 minutes.",
      "Pour 3 Tbsp. oil into a large (preferably glass) bowl and swirl to coat sides. Scrape in dough with a large spatula or flexible bench scraper. Cover and place in a warm spot until dough is doubled in volume, 2–3 hours. If using a glass bowl, it’s helpful to mark the position of the dough at the beginning so you can accurately assess the rise (a dry-erase marker or piece of tape works).",
      "Drizzle 2 Tbsp. oil over a 18x13inch sheet pan and use fingertips to rub all over bottom and sides. Using large spatula or flexible bench scraper, fold dough inside bowl a couple of times to deflate, then scrape onto prepared baking sheet. Using oiled hands, lift up dough and fold over onto itself in half, then rotate baking sheet 90° and fold in half again. Cover dough with a piece of well-oiled plastic and let rest 10 minutes to let gluten relax.",
      "Uncover and go back in with oiled hands, gently stretching dough (to avoid tearing) across length and width of baking sheet in an even layer, working all the way to edges and into corners. If dough starts to spring back, let sit 5–10 minutes and start again. Cover again with same piece of oiled plastic and chill at least 8 hours and up to 24.",
      "Let sheet pan sit in a warm spot until dough is puffed and bubbly and nearly doubled in height, 45–65 minutes (if you’re using a standard half sheet pan, it will have risen to the very top of the sides). Meanwhile, place a rack in center of oven; preheat to 450°.",
      "Remove plastic and drizzle dough generously with more oil. Oil hands again and press fingertips firmly into dough, pushing down all the way to bottom of pan to dimple all over. Sprinkle generously with sea salt.",
      "Bake focaccia until surface is deep golden brown all over, 25–35 minutes. Let cool in pan 10 minutes. Slide a thin metal spatula underneath focaccia to loosen from sheet pan (it may stick in a couple of places, so use some elbow grease to get underneath) and transfer to a wire rack. Let cool completely before cutting as desired.",
      "Do Ahead: Focaccia can be baked 1 day ahead. Tightly wrap in plastic and store at room temperature."
    ],
    "dietary": [
      "VG",
      "V",
      "DF"
    ],
    "tags": [
      "focaccia bread",
      "bread",
      "vegan",
      "vegetarian",
      "dairy free",
      "italian"
    ]
  },
  {
    "category": "other",
    "url": "/other/thanksgiving_stuffing",
    "title": "Thanksgiving Stuffing",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614627566/clarklake_cookbook/stuffing_sm_dvd1sf.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614627567/clarklake_cookbook/stuffing_lg_qrdlue.jpg",
    "yield": 8,
    "prepTime": 25,
    "cookTime": 60,
    "ingredientsList": [
      "2 baguettes, country, or sourdough bread (1 pound)",
      "8 tbsp. butter, plus more for baking dish",
      "1 large onion, diced (about 2 1/4 cups)",
      "4 stalks celery, thinly sliced",
      "2 cloves garlic, minced",
      "1/2 c. freshly chopped parsley",
      "1 tbsp. freshly chopped sage, minced",
      "1 tbsp. fresh thyme leaves, minced",
      "1/2 tbsp. freshly chopped rosemary",
      "Kosher salt",
      "Freshly ground black pepper",
      "4 c. low-sodium chicken (or vegetable) broth",
      "2 large eggs, beaten"
    ],
    "directionsList": [
      "The day before: Tear or slice bread into 1/4inch cubes and leave out overnight to dry out. (Alternately, place bread on baking sheets and bake at 200º for 20 minutes.)",
      "When you're ready to make the stuffing: Preheat oven to 350º and butter a large baking dish. In a large skillet over medium heat, melt butter. Add onion and celery and cook until soft and fragrant, 8 minutes. Stir in garlic, parsley, sage, thyme, and rosemary and cook until fragrant, 1 minute more. Season with salt and pepper. ",
      "Place bread in a large bowl and add skillet mixture. Toss to combine. In a medium bowl, whisk together chicken broth and beaten eggs and pour over bread mixture. Season generously with salt and pepper and toss until completely coated.",
      "Transfer mixture to prepared baking dish and cover with foil. Bake until cooked through, 45 minutes, then remove foil and cook until bread is golden, 15 to 20 minutes more."
    ],
    "dietary": [],
    "tags": [
      "thanksgiving stuffing",
      "stuffing",
      "american",
      "bread",
      "sides"
    ]
  },
  {
    "category": "other",
    "url": "/other/dashi",
    "title": "Dashi",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662434/clarklake_cookbook/dashi_sm_zgqtqb.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662434/clarklake_cookbook/dashi_lg_1_iggter.jpg",
    "yield": "1 qt",
    "prepTime": 5,
    "cookTime": 15,
    "ingredientsList": [
      "1 piece kombu (dried kelp)",
      "10 g katsuobushi (dried bonito flakes)",
      "1 qt(4 cups) water"
    ],
    "directionsList": [
      "Gather all the ingredients. Most Japanese recipes would say to gently clean the kombu with a damp cloth. However, these days, kombu is pretty clean so just make sure it doesn't look musty. DO NOT wash or wipe off the white powdery substance (Mannitol), which contributes to the umami flavor in dashi.",
      "Make a couple of slits on the kombu, which will help release more flavor.",
      "In a medium pot, put the kombu and water. If you have cold brew Kombu Dashi (previous step), add Kombu Dashi and hydrated kombu in the pot.",
      "Turn on the heat to medium-low heat and slowly bring to almost boil, about 10 minutes.",
      "Meanwhile, clean the dashi by skimming the surface.",
      "Just before the dashi starts boiling gently, remove kombu from the pot (Discard or use for other recipes - continue reading). If you leave the kombu in the pot, the dashi will become slimy and bitter.",
      "Add the katsuobushi and bring it back to a boil again.",
      "Once the dashi is boiling, reduce the heat, simmer for just 30 seconds, and turn off the heat.",
      "Let the katsuobushi sink to the bottom, about 10 minutes.",
      "Strain the dashi through a fine-mesh sieve over a bowl or measuring cup. Awase Dashi is ready to use.",
      "If you are not using the dashi right away, store the dashi in a bottle or mason jar and keep in the refrigerator for 3-5 days or in the freezer for 2 weeks."
    ],
    "dietary": [
      "DF",
      "GF"
    ],
    "tags": [
      "dashi broth",
      "broth",
      "soup",
      "japanese",
      "base",
      "seaweed",
      "dairy free",
      "gluten free"
    ]
  },
  {
    "category": "other",
    "url": "/other/miso_soup",
    "title": "Miso Soup",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662435/clarklake_cookbook/miso_soup_sm_dqu5le.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662436/clarklake_cookbook/miso_soup_lg_rxszvc.jpg",
    "yield": "1 bowl",
    "prepTime": 10,
    "cookTime": 15,
    "ingredientsList": [
      "1 cup dashi",
      "1 Tbsp miso (18 g)",
      "1/4 cup of firm tofu",
      "20 g dehydraged wakame(seaweed)",
      "Green onion/scallion, chopped"
    ],
    "directionsList": [
      "Add dashi and bring to a boil",
      "Dissolve miso paste in boiling dashi",
      "Once miso is dissolved and incorporated, add tofu and wakame. Cook for 2 minutes.",
      "Add green onions and serve"
    ],
    "dietary": [
      "DF",
      "GF"
    ],
    "tags": [
      "miso soup",
      "dashi",
      "soup",
      "japanese",
      "seaweed",
      "tofu",
      "dairy free",
      "gluten free"
    ]
  },
  {
    "category": "other",
    "url": "/other/vegetable_broth",
    "title": "Vegetable Broth",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662443/clarklake_cookbook/vegetable_broth_sm_saxioi.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615662443/clarklake_cookbook/vegetable_broth_lg_zmevog.jpg",
    "yield": "3 qt",
    "prepTime": 25,
    "cookTime": "Up to 2H",
    "ingredientsList": [
      "1 large onion",
      "1 garlic bulb",
      "3 tbsp olive oil",
      "4 sticks celery",
      "1 fuji apple (or any other kind you have)",
      "1 potato",
      "5-6 cremini mushrooms",
      "2 tbsp Himalayan pink salt",
      "10g kombu",
      "3L water (12 cups)"
    ],
    "directionsList": [
      "Peel and roughly chop the onion. Slice the whole garlic bulb in half",
      "Heat a stock pot to medium heat. Add a good drizzle of olive oil",
      "Add in the onions and garlic.  Sauté for 5-8min",
      "Roughly chop the celery and add to the pot. Dice the apple and add to the pot",
      "Sauté for another 5-8min",
      "Dice the potato and slice the mushrooms. Add them to the pot followed by the pink salt",
      "Add about 10g of kombu to the pot followed by the water",
      "Turn up heat to bring to a boil, then cover and cook on medium low for at least 45min but ideally 1.5 - 2 hours",
      "Pour the stock into a large bowl using a sieve or colander to catch the solid ingredients. Then, use a ladle or colander to press down and extract as much of the stock as possible",
      "Transfer the stock to some jars. Let them cool before placing in the fridge"
    ],
    "dietary": [
      "V",
      "VG",
      "DF",
      "GF"
    ],
    "tags": [
      "vegetable stock",
      "vegetable broth",
      "broth",
      "stock",
      "soup",
      "vegetarian",
      "vegan",
      "dairy free",
      "gluten free"
    ]
  },
  {
    "category": "other",
    "url": "/other/pizza_dough",
    "title": "Pizza Dough",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462284/clarklake_cookbook/pizza_dough_sm_vip3lr.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1614462284/clarklake_cookbook/pizza_dough_lg_mf8jdf.jpg",
    "yield": "1 Pizza",
    "prepTime": 20,
    "cookTime": 15,
    "ingredientsList": [
      "3/4 cups water warm, 180mL",
      "2 cups all-purpose flour 240g, or bread flour",
      "1 packet yeast 7g",
      "1 tbsp granulated sugar",
      "3/4 tsp salt",
      "1 tbsp olive oil"
    ],
    "directionsList": [
      "In a warm mixing bowl, add warm water (about 100F), yeast and half the sugar. Mix then wait about 7 minutes or until you see bubbles forming in the mixture.",
      "Mix the flour, remaining sugar, and salt in a bowl. If you're adding some dried herbs like thyme or rosemary they can get mixed in now.",
      "Attach a dough hook to a stand mixer then add the flour and mix on low for about 1 minute. Increase to medium speed until the dough comes together in a ball.",
      "Lightly flour your work surface and knead the dough until it's smooth and springs back when poked.",
      "Use olive oil to coat the dough ball. Place it in a greased bowl. Cover with plastic wrap and place in a warm draft-free place to rise for about an hour or until the dough has doubled in size.",
      "Preheat the oven to 450F degrees. When the dough has doubled, press it down and shape into a disk. You can knead It a few times If the texture needs some smoothing out or be fancy and twirl it in the air like a professional.",
      "After your dough has been shaped you can brush with olive oil then add sauce, cheese and your choice of toppings.",
      "Bake at 450F for about 12-15 minutes or until golden."
    ],
    "dietary": [
      "V"
    ],
    "tags": [
      "pizza dough",
      "dough",
      "bread",
      "vegetarian"
    ]
  },
  {
    "category": "other",
    "url": "/other/dumpling_wrapper",
    "title": "Dumpling Wrapper",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1616099718/clarklake_cookbook/dumpling_wrapper_sm_d8fdrd.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1616099718/clarklake_cookbook/dumpling_wrapper_lg_bmm4uz.jpg",
    "yield": "20",
    "prepTime": "30M",
    "cookTime": "5M",
    "ingredientsList": [
      "140g plain flour",
      "80g boiled water, allowed to cool for 2 minutes"
    ],
    "directionsList": [
      "To making the dumpling wrappers, place the flour in a large bowl and make a well in the centre. Pour in the warm water, stirring with a wooden spoon. Once the mixture starts to come together use your hands to knead until the dough forms a clean ball. Transfer the dough to a floured work surface and knead for 3-4 minutes or until the dough is firm and bounces back when you poke it with your finger. Place the dough in a sealable bag and seal. Let the dough rest and steam in the bag for 15 minutes.",
      "Stretch dough into a bagel-type shape. Then cut in half to form 2 equal-sized logs. Take one log and roll it to about 2cm in diameter. Cut into even pieces (each log should make about 10 pieces that are about 10g per piece). Roll each piece into a ball. Take one ball and use a plastic cup or small rolling pin to roll the ball into a flat circle. Then roll the edges of the circle thinner than the centre. You should finish up with a wrapper about the size of your palm. Place wrapper onto a floured surface and continue the same process with the remaining dough. Be sure to generously flour between the stacked wrappers and don’t pile too many on top of each other because the weight can cause them to stick together.",
      "Use straight away. Or keep frozen in sealable bags.",
      "When using from frozen – thaw for about an hour outside of the freezer. Carefully separate the wrappers and sprinkle each with extra flour."
    ],
    "dietary": [
      "V",
      "VG",
      "DF"
    ],
    "tags": [
      "dumpling wrappers",
      "wrappers"
    ]
  },
  {
    "category": "other",
    "url": "/other/mandarin_pancakes",
    "title": "Mandarin Pancakes",
    "attImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615582679/clarklake_cookbook/mandarin_pancakes_sm_euawac.jpg",
    "bannerImg": "https://res.cloudinary.com/dzz7rzvkf/image/upload/v1615582679/clarklake_cookbook/mandarin_pancake_lg_ten0pi.jpg",
    "yield": "12 Pancakes",
    "prepTime": 30,
    "cookTime": 15,
    "ingredientsList": [
      "2 cups plus 2 tablespoons/280 grams all-purpose flour, plus more for dusting",
      "⅓ cup plus 2 tablespoons/100 milliliters boiling water",
      "⅓ cup plus 2 tablespoons/100 milliliters cold water",
      "Vegetable oil or roasted sesame oil, for brushing"
    ],
    "directionsList": [
      "Place flour in a medium bowl. Add the boiling water in a thin stream while stirring with chopsticks or a wooden spoon. It helps to set the bowl in a heavy saucepan lined with a dish towel to keep it stable, or a friend stabilize the bowl as you do this. Add the cold water in a thin stream, continuing to mix the whole time. Stir the mixture until it turns into a shaggy ball, then dump the ball out onto a lightly floured work surface.",
      "Knead the dough with your hands until it forms a smooth ball, about 5 minutes. Cover the dough ball with a damp dish towel and let rest at room temperature for at least 30 minutes or up to a couple hours.",
      "Roll the dough into a log roughly 10 inches long, then cut it in half crosswise. Line up the two small logs, then section each one in 6ths to form 12 pieces (for approximate 8-inch pancakes); in 8ths for 16 pieces (for approximate 7-inch pancakes) or in 10ths for 20 pieces (for approximate 6-inch pancakes).",
      "Roll two pieces into smooth balls between your hands, working with one piece at a time. Then, using a rolling pin or wine bottle, gently roll each of the two pieces into circular disks about 1/4-inch thick. (You’ll cook two pieces at a time and proceed through the end of Step 7 before rolling out the remaining balls.)",
      "Brush the top of one disk with a thin, even layer of oil, then stack the second disk on top. Using a rolling pin, roll the stacked disks into a 6- to 8-inch circle. The size will depend on the number of balls you made in Step 3.",
      "Heat a cast-iron, carbon steel, or nonstick skillet over medium until a drop of water flicked onto the surface immediately bubbles and evaporates (about 2 minutes), then add the rolled, stacked disk. Let cook on one side until blistered and browned in spots, about 1 minute. Flip and cook until second side is blistered and browned. Sometimes the pancakes will bubble up with steam as they cook, preventing the second side from making good contact with the pan. You can gently press down on them with a flat spatula if this happens.",
      "Remove the cooked disk, then carefully peel it apart into two thin pancakes while still hot. Transfer to a plate and cover with a clean dish towel.",
      "Repeat Steps 4 through 7 for the remaining dough balls, adjusting heat as necessary to make sure the pancakes brown in spots but don’t blacken. Finished pancakes should be served while still warm. To store leftovers, place the pancakes on large squares of plastic wrap or aluminum foil, then roll them up like a jelly roll and refrigerate. Reheat covered in the microwave, or briefly heat one at a time in a hot, dry skillet."
    ],
    "dietary": [
      "V",
      "VG",
      "DF"
    ],
    "tags": [
      "mandarin pancakes",
      "pancakes",
      "moo shu mushrooms",
      "wrap",
      "vegan",
      "vegetarian",
      "dairy free",
      "chinese"
    ]
  }
]